Repository: KDE/kompare
Catalog: po/*/kompare.po
Languages: eo, is, zh_cn

# NAME OF TRANSLATORS
source: Your names
eo: Axel Rousseau, Oliver Kellogg
is: Björgvin Ragnarsson, Sveinn í Felli
zh_cn: KDE 中国

# EMAIL OF TRANSLATORS
source: Your emails
eo: axel@esperanto-jeunes.org,okellogg@users.sourceforge.net
is: nifgraup@hotmail.com, sv1@fellsnet.is
zh_cn: kde-china@kde.org

# @title:window
source: Navigation
eo: Navigado
is: Flakk
zh_cn: 导航

# @action
source: &Open Diff...
eo: &Malfermi Diferencon...
is: &Opna diff-mismun...
zh_cn: 打开 diff 文件(&O)...

# @action
source: &Compare Files...
eo: &Kompari dosierojn...
is: &Bera saman skrár...
zh_cn: 比较文件(&C)...

# @action
source: &Blend URL with Diff...
eo: &Miksi URL kun Diferenco...
is: &Blanda slóð við mismun...
zh_cn: 合并 diff 到 URL(&B)...

# @action
source: Show T&ext View
eo: Montri T&ekstan Vidon
is: Sýna T&extasýn
zh_cn: 显示文本视图(&E)

source: 0 of 0 differences
eo: 0 el 0 diferencoj
is: 0 of 0 mismunum
zh_cn: 无差异

source: 0 of 0 files
eo: 0 el 0 dosieroj
is: 0 af 0 skrár
zh_cn: 无文件

source: %2 of %1 file
eo: %2 el %1 dosiero
is: %2 af %1 skrá
zh_cn: %1 个文件中的 %2 个

source: %1 file
eo: %1 dosiero
is: %1 skrá
zh_cn: %1 个文件

source: %2 of %1 difference, %3 applied
eo: %2 el %1 diferenco, %3 aplikita
is: %2 af %1 mismun, %3 virkjað
zh_cn: %1 个差异中的 %2 个，%3 个已应用

source: %1 difference
eo: %1 diferenco
is: %1 mismunur
zh_cn: %1 个差异

# @title:window
source: Blend File/Folder with diff Output
eo: Miksi dosieron/dosierujon kun diff-eligo
is: Blanda skrá/möppu við diff-mismunaúttak
zh_cn: 合并 diff 输出到文件/文件夹

# @title:group
source: File/Folder
eo: Dosiero/dosierujo
is: Skrá/mappa
zh_cn: 文件/文件夹

# @title:group
source: Diff Output
eo: Eligo de diff
is: Diff-mismunaúttak
zh_cn: Diff 输出

# @action:button
source: Blend
eo: Miksi
is: Blanda
zh_cn: 合并

# @info:tooltip
source: Blend this file or folder with the diff output
eo: Miksi ĉi tiun dosieron aŭ dosierujon kun la dif-eligo
is: Blanda þessari skrá eða möppu við diff-mismunaúttakið
zh_cn: 合并 diff 输出到此文件或文件夹

# @infor:whatsthis
source: If you have entered a file or folder name and a file that contains diff output in the fields in this dialog then this button will be enabled and pressing it will open kompare's main view where the output of the entered file or files from the folder are mixed with the diff output so you can then apply the difference(s) to a file or to the files.
eo: Se vi enigis dosieron aŭ dosierujon nomon kaj dosieron, kiu enhavas dif-eligon en la kampoj en ĉi tiu dialogo, tiam ĉi tiu butono estos ebligita kaj premante ĝin malfermos la ĉefan vidon de kompare, kie la eligo de la enigitaj dosiero aŭ dosieroj el la dosierujo estas miksita. kun la diferenca eligo por ke vi tiam povu apliki la diferencon(j)n al dosiero aŭ al la dosieroj.
zh_cn: 如果您在此对话框中输入了文件或文件夹名称，以及包含 diff 输出的文件，则此按钮可以使用。单击此按钮后，将打开 kompare 的主视图，输入的文件或文件夹中的文件将会与 diff 输出混合，这样您就可以将差异应用到文件了。

# @title:window
source: Compare Files or Folders
eo: Kompari dosierojn aŭ dosierujojn
is: Bera saman skrár eða möppur
zh_cn: 比较文件或文件夹

# @title:group
source: Source
eo: Fonto
is: Uppruni
zh_cn: 源文件

# @title:group
source: Destination
eo: Celo
is: Áfangastaður
zh_cn: 目标文件

# @action:button
source: Compare
eo: Kompari
is: Bera saman
zh_cn: 比较

# @info:tooltip
source: Compare these files or folders
eo: Kompari ĉi tiujn dosierojn aŭ dosierujojn
is: Bera saman þessar skrár eða möppur
zh_cn: 比较这些文件或文件夹

# @info:whatsthis
source: If you have entered 2 filenames or 2 folders in the fields in this dialog then this button will be enabled and pressing it will start a comparison of the entered files or folders.
eo: Se vi enigis 2 dosiernomojn aŭ 2 dosierujojn en la kampoj en ĉi tiu dialogo, tiam ĉi tiu butono estos ebligita kaj premante ĝin komencos komparon de la enigitaj dosieroj aŭ dosierujoj.
is: Ef þú slærð inn 2 skráarnöfn eða 2 möppur í svæðin í þessum glugga verður þessi hnappur virkur og með því að smella á hann hefst samanburður á völdum skrám eða möppum.
zh_cn: 在对话框的字段中输入了两个文件名或文件夹名，此按钮才可用， 按下它，将开始比较所输入的文件或文件夹。

# @title:window
source: Text View
eo: Teksta Vido
is: Textasýn
zh_cn: 文本视图

source: &File
eo: &Dosiero
is: &Skrá
zh_cn: 文件(&F)

source: &Settings
eo: A&gordo
is: &Stillingar
zh_cn: 设置(&S)

source: Main Toolbar
eo: Ĉefa ilobreto
is: Aðalverkfæraslá
zh_cn: 主工具栏

# @title:tab
source: Files
eo: Dosieroj
is: Skrár
zh_cn: 文件

source: Here you can enter the files you want to compare.
eo: Ĉi tie vi povas enigi la dosierojn, kiujn vi volas kompari.
is: Hér getur þú gefið upp skrárnar sem þú vilt bera saman.
zh_cn: 您可以在这里输入想要比较的文件。

source: Here you can change the options for comparing the files.
eo: Ĉi tie vi povas ŝanĝi la opciojn por kompari la dosierojn.
is: Hér getur þú breytt valkostum fyrir samanburð skráa.
zh_cn: 您可以在这里更改文件比较的选项。

# @title:tab
source: Appearance
eo: Aspekto
is: Útlit
zh_cn: 外观

source: Here you can change the options for the view.
eo: Ĉi tie vi povas ŝanĝi la opciojn por la vido.
is: Hér getur þú breytt valkostum fyrir ásýndina.
zh_cn: 您可以在这里更改视图选项。

source: File used for excluding files cannot be found, please specify another file.
eo: Dosiero uzata por ekskludi dosierojn ne troveblas, bonvolu specifi alian dosieron.
is: Skrá sem notuð er til að undanskilja skrár fannst ekki, prófaðu einhverja aðra skrá.
zh_cn: 找不到用于排除的文件。请另行指定文件。

source: A program to view the differences between files and optionally generate a diff
eo: Programo por vidi la diferencojn inter dosieroj kaj laŭvole generi diferencon
is: Forrit til að skoða mismun á milli skráa auk þess sem hægt er að búa til diff
zh_cn: 本程序查看文件间的差异，并可以生成 diff 结果

source: Author
eo: Aŭtoro
is: Höfundur
zh_cn: 作者

source: Developer
eo: Kreinto
is: Aðalforritari
zh_cn: 开发者

source: Maintainer
eo: Prizorganto
is: Umsjónarmaður
zh_cn: 维护者

source: Kompare icon artist
eo: Kompari ikonartisto
is: Kompare táknmynd
zh_cn: Kompare 图标制作者

source: A lot of good advice
eo: Multaj bonaj konsiloj
is: Fullt af góðum ráðum
zh_cn: 许多好建议

source: Cervisia diff viewer
eo: Cervisia diff-spektilo
is: Cervisia diff-mismunarskoðari
zh_cn: Cervisia diff 查看器

source: This will compare URL1 with URL2
eo: Ĉi tio komparos URL1 kun URL2
is: Þetta mun bera SLÓÐ1 saman við SLÓÐ2.
zh_cn: 这将比较 URL1 和 URL2

source: This will open URL1 and expect it to be diff output. URL1 can also be a '-' and then it will read from standard input. Can be used for instance for cvs diff | kompare -o -. Kompare will do a check to see if it can find the original file(s) and then blend the original file(s) into the diffoutput and show that in the viewer. -n disables the check.
eo: Ĉi tio malfermos URL1 kaj atendos, ke ĝi estos dif-eligo. URL1 ankaŭ povas esti '-' kaj tiam ĝi legos el norma enigo. Uzeblas ekzemple por cvs diff | kompare -o -. Kompare faros kontrolon por vidi ĉu ĝi povas trovi la originalajn dosierojn kaj poste miksi la originalajn dosierojn en la difproduktaĵon kaj montri tion en la spektanto. -n malŝaltas la kontrolon.
zh_cn: 这将打开 URL1，并假定其为 diff 结果。URL1 亦可以是“-”，表示从标准输入读取，应用例子为“cvs diff | kompare -o -”。Kompare 会检查能否找到原始文件，然后合并原始文件并将结果显示在查看器中，“-n”选项关闭此检查。

source: This will blend URL2 into URL1, URL2 is expected to be diff output and URL1 the file or folder that the diffoutput needs to be blended into.
eo: Ĉi tio miksos URL2 en URL1, URL2 estas atendita esti dif-eligo kaj URL1 la dosiero aŭ dosierujo, en kiu la dif-eligo devas esti miksita.
zh_cn: 这将合并 URL2 到 URL1，URL2 应为 diff 结果而 URL1 则是要被合并的文件或文件夹。

source: Disables the check for automatically finding the original file(s) when using '-' as URL with the -o option.
eo: Malebligas la kontrolon por aŭtomate trovi la originalan dosieron(j) kiam oni uzas '-' kiel URL kun la opcio -o.
zh_cn: 当使用“-o”选项且 URL 为“-”时，不自动检查原始文件的存在。

source: Use this to specify the encoding when calling it from the command line. It will default to the local encoding if not specified.
eo: Uzu ĉi tion por specifi la kodigon kiam oni vokas ĝin de la komandlinio. Ĝi defaŭlte al la loka kodigo se ne specifita.
zh_cn: 使用此处指定从命令行调用时所用的编码。如果未指定，则默认为系统的本地编码。

# @title:group
source: Diff Program
eo: Diff Programo
is: Diff forrit
zh_cn: diff 程序

source: You can select a different diff program here. On Solaris the standard diff program does not support all the options that the GNU version does. This way you can select that version.
eo: Vi povas elekti malsaman diferencan programon ĉi tie. Sur Solaris la norma difprogramo ne subtenas ĉiujn opciojn kiujn la GNU-versio faras. Tiel vi povas elekti tiun version.
is: Hér getur þú valið annað diff forrit. Á Solaris styður staðlaða diff-mismunaforritið ekki við alla þá valkosti sem GNU-útgáfan gerir. Þarna geturðu tiltekið hvaða útgáfu þú ætlar að nota.
zh_cn: 在此可以选择另外一个 diff 程序。在 Solaris 上，标准 diff 程序不支持 GNU 版本的所有选项，因此可以选择 GNU 版本。

# @info:whatsthis
source: Select the format of the output generated by diff. Unified is the one that is used most frequently because it is very readable. The KDE developers like this format the best so use it for sending patches.
eo: Elektu la formaton de la eligo generita de dif. Unuigita estas tiu, kiu estas uzata plej ofte, ĉar ĝi estas tre legebla. La programistoj de KDE plej ŝatas ĉi tiun formaton, do uzu ĝin por sendi flikojn.
zh_cn: 选择 diff 产生结果的格式。统一(unified)是种经常使用的格式，它非常容易阅读，因此 KDE 开发者发送补丁时最喜欢这种格式。

# @title:group
source: Output Format
eo: Eligoformato
is: Úttakssnið
zh_cn: 输出格式

# @option:radio format type
source: Context
eo: Kunteksto
is: Samhengi
zh_cn: 上下文

# @option:radio format type
source: Normal
eo: Normala
is: Venjulegt
zh_cn: 正常

# @option:radio format type
source: Unified
eo: Unuigita
is: Sameinað
zh_cn: 统一

# @title:group
source: Lines of Context
eo: Linioj de Kunteksto
is: Línur af samhengi
zh_cn: 上下文行数

# @info:whatsthis
source: The number of context lines is normally 2 or 3. This makes the diff readable and applicable in most cases. More than 3 lines will only bloat the diff unnecessarily.
eo: La nombro da kuntekstolinioj estas normale 2 aŭ 3. Ĉi tio faras la diferencon legebla kaj aplikebla en la plej multaj kazoj. Pli ol 3 linioj nur ŝveligos la diferencon nenecese.
zh_cn: 上下文的行数通常是 2 或 3，这样使得 diff 容易阅读，且能应用于大多数场合。多于 3 行一般是不需要的。

# @label:spinbox
source: Number of context lines:
eo: Nombro da kuntekstlinioj:
is: Fjöldi samhengislína:
zh_cn: 上下文行数：

# @title:tab
source: Format
eo: Formato
is: Snið
zh_cn: 格式

# @title:group
source: General
eo: Ĝeneralo
is: Almennt
zh_cn: 常规

# @option:check
source: &Treat new files as empty
eo: &Trakti novajn dosierojn kiel malplenajn
is: Fara með nýjar skrár sem &tómar
zh_cn: 将新文件作为空文件处理(&T)

# @info:tooltip
source: This option corresponds to the -N diff option.
eo: Ĉi tiu opcio respondas al la opcio -N dif.
is: Þetta samsvarar -N diff valkostinum.
zh_cn: 对应于 diff 的 -N 选项。

# @info:whatsthis
source: With this option enabled diff will treat a file that only exists in one of the directories as empty in the other directory. This means that the file is compared with an empty file and because of this will appear as one big insertion or deletion.
eo: Kun ĉi tiu opcio ebligita, dif traktos dosieron kiu nur ekzistas en unu el la dosierujoj kiel malplenan en la alia dosierujo. Ĉi tio signifas, ke la dosiero estas komparata kun malplena dosiero kaj pro tio aperos kiel unu granda enmeto aŭ forigo.
zh_cn: 启用此选项时，差异对比程序会将仅存在于两个目录之一，另一个目录里不存在的文件当作空文件处理。这就意味着此文件可能会在差异对比结果中产生较大的新增或删除内容。

# @option:check
source: &Look for smaller changes
eo: Serĉi p&li malgrandajn ŝanĝojn
is: &Skoða eftir minniháttar breytingum
zh_cn: 查找较小的修改(&L)

# @info:tooltip
source: This corresponds to the -d diff option.
eo: Ĉi tio respondas al la -d dif-opcio.
is: Þetta samsvarar -d diff valkostinum.
zh_cn: 对应于 diff 的 -d 选项。

# @info:whatsthis
source: With this option enabled diff will try a little harder (at the cost of more memory) to find fewer changes.
eo: Kun ĉi tiu opcio ebligita, dif provos iom pli malfacile (koste de pli da memoro) trovi malpli da ŝanĝoj.
zh_cn: 启用此选项时，差异对比程序会试图使用内存开销较大的算法去查找较小的修改。

# @option:check
source: O&ptimize for large files
eo: O&ptimumigi por grandaj dosieroj
is: Besta fyrir stórar skrár
zh_cn: 优化大文件(&P)

# @info:tooltip
source: This corresponds to the -H diff option.
eo: Ĉi tio respondas al la -H dif-opcio.
is: Þetta samsvarar -H diff valkostinum.
zh_cn: 对应于 diff 的 -H 选项。

# @info:whatsthis
source: This option lets diff makes better diffs when using large files. The definition of large is nowhere to be found though.
eo: Ĉi tiu opcio ebligas ke dif faras pli bonajn diferencojn kiam vi uzas grandajn dosierojn. La difino de granda tamen nenie troviĝas.
zh_cn: 启用此选项时，差异对比程序会优化大文件。

# @option:check
source: &Ignore changes in case
eo: &Ignori ŝanĝojn usklecajn
is: &Hunsa breytingar á há-/lágstöfum
zh_cn: 忽略大小写变化(&I)

# @info:tooltip
source: This corresponds to the -i diff option.
eo: Ĉi tio respondas al la opcio -i diff.
is: Þetta samsvarar -i diff valkostinum.
zh_cn: 对应于 diff 的 -i 选项。

# @info:whatsthis
source: With this option to ignore changes in case enabled, diff will not indicate a difference when something in one file is changed into SoMEthing in the other file.
eo: Kun ĉi tiu opcio por ignori ŝanĝojn en kazo ebligita, diff ne indikos diferencon kiam io en unu dosiero estas ŝanĝita en Ion en la alia dosiero.
zh_cn: 启用此选项时，差异对比程序会忽略大小写的变化，比如一个文件中的 something 单词在另一个文件中是 SoMEthing 时，程序不会将其视作不同。

# @option:check
source: Ignore regexp:
eo: Ignori regexp:
is: Hunsa regexp:
zh_cn: 忽略正则表达式：

# @info:tooltip
source: This option corresponds to the -I diff option.
eo: Ĉi tiu opcio respondas al la opcio -I diff.
is: Þetta samsvarar -I diff valkostinum.
zh_cn: 对应于 diff 的 -I 选项。

# @info:whatsthis
source: When this checkbox is enabled, an option to diff is given that will make diff ignore lines that match the regular expression.
eo: Kiam ĉi tiu markobutono estas ebligita, opcio al diff estas donita, kiu igos diff ignori liniojn kiuj kongruas kun la regula esprimo.
zh_cn: 启用此选项时，将对差异对比程序给定一个正则表达式，符合此表达式的行会被差异对比程序忽略。

# @info:tooltip
source: Add the regular expression here that you want to use to ignore lines that match it.
eo: Aldonu ĉi tie la regulan esprimon, kiun vi volas uzi\por ignori liniojn kiuj kongruas kun ĝi.
is: Bættu við reglulegu segðinni sem þú vilt nota til að hunsa línur sem samsvara henni.
zh_cn: 在此添加正则表达式，匹配到的行将被忽略。

# @title:group
source: Whitespace
eo: Blanka spaco
is: Bil
zh_cn: 空白

# @option:check
source: E&xpand tabs to spaces in output
eo: Vas&tigi langetojn al spacoj en eligo
is: Breyta dálkalyklum (Tab) í bil í úttaki
zh_cn: 输出时将制表符扩展成空格(&X)

# @info:tooltip
source: This option corresponds to the -t diff option.
eo: Ĉi tiu opcio respondas al la opcio -t diff.
is: Þetta samsvarar -t diff valkostinum.
zh_cn: 对应于 diff 的 -t 选项。

# @info:whatsthis
source: This option does not always produce the right result. Due to this expansion Kompare may have problems applying the change to the destination file.
eo: Ĉi tiu opcio ne ĉiam produktas la ĝustan rezulton. Pro ĉi tiu ekspansio Kompare povas havi problemojn aplikante la ŝanĝon al la celdosiero.
zh_cn: 此选项有时可能产生不正确的结果，因此 Kompare 在将差异结果应用到目标文件时可能会有问题。

# @option:check
source: I&gnore added or removed empty lines
eo: Mi&ignoras aldonitajn aŭ forigitajn malplenajn liniojn
is: &Hunsa viðbættar eða fjarlægðar tómar línur
zh_cn: 忽略增加或删除的空行(&G)

# @info:tooltip
source: This option corresponds to the -B diff option.
eo: Ĉi tiu opcio respondas al la -B dif-opcio.
is: Þetta samsvarar -B diff valkostinum.
zh_cn: 对应于 diff 的 -B 选项。

# @info:whatsthis
source: This can be very useful in situations where code has been reorganized and empty lines have been added or removed to improve legibility.
eo: Ĉi tio povas esti tre utila en situacioj kie kodo estis reorganizita kaj malplenaj linioj estis aldonitaj aŭ forigitaj por plibonigi legeblecon.
zh_cn: 当为易读性考虑，有人代码进行过格式重排，以及增减过空行的情况下，此选项十分有用。

# @option:check
source: Ig&nore changes in the amount of whitespace
eo: Ig&nore ŝanĝoj en la kvanto de blankspaco
is: H&unsa breytingar í fjölda bila
zh_cn: 忽略空白字符个数的变化(&N)

# @info:tooltip
source: This option corresponds to the -b diff option.
eo: Ĉi tiu opcio kongruas kun la opcio -b de diff.
is: Þetta samsvarar -b diff valkostinum.
zh_cn: 对应于 diff 的 -b 选项。

# @info:whatsthis
source: If you are uninterested in differences arising due to, for example, changes in indentation, then use this option.
eo: Se vi ne interesiĝas pri diferencoj estiĝantaj pro, ekzemple, ŝanĝoj en indentaĵo, tiam uzu ĉi tiun opcion.
zh_cn: 如果您对诸如缩进数量不同一类差异不感兴趣时，可使用此选项。

# @option:check
source: Ign&ore all whitespace
eo: Ign&ori ĉiujn blankspacojn
is: Hunsa öll biltákn
zh_cn: 忽略所有空白字符(&O)

# @info:tooltip
source: This option corresponds to the -w diff option.
eo: Ĉi tiu opcio respondas al la opcio -w diff.
is: Þetta samsvarar -w diff valkostinum.
zh_cn: 对应于 diff 的 -w 选项。

# @info:whatsthis
source: This is useful for seeing the significant changes without being overwhelmed by all the white space changes.
eo: Ĉi tio estas utila por vidi la signifajn ŝanĝojn sen esti superfortita de ĉiuj blankspacaj ŝanĝoj.
zh_cn: 如果您想忽略空白字符修改，只要查看最关键的文件改变时，此选项十分有用。

# @option:check
source: Igno&re changes due to tab expansion
eo: Igno&ri ŝanĝojn pro langeto vastiĝo
is: Hunsa b&reytingar vegna útvíkkunar dálkmerkja
zh_cn: 忽略制表符扩展所带来的变化(&R)

# @info:tooltip
source: This option corresponds to the -E diff option.
eo: Ĉi tiu opcio respondas al la opcio -E dif.
is: Þetta samsvarar -E diff valkostinum.
zh_cn: 对应于 diff 的 -E 选项。

# @info:whatsthis
source: If there is a change because tabs have been expanded into spaces in the other file, then this option will make sure that these do not show up. Kompare currently has some problems applying such changes so be careful when you use this option.
eo: Se estas ŝanĝo ĉar langetoj estis vastigitaj al spacoj en la alia dosiero, tiam ĉi tiu opcio certigos, ke ĉi tiuj ne aperos. Kompare nuntempe havas kelkajn problemojn aplikante tiajn ŝanĝojn do atentu kiam vi uzas ĉi tiun opcion.
zh_cn: 如果在一个文件中发生过诸如制表符被扩展为空格等改变时，此选项会确保此类改变不被显现出来。Kompare 现在在应用这类差异时可能会有一些问题，如果您使用此选项，请务必小心。

# @title:tab
source: Options
eo: Opcioj
is: Valkostir
zh_cn: 选项

# @title:group
source: File Pattern to Exclude
eo: Dosiera Ŝablono por Ekskludi
is: Skráamynstur sem á að hunsa
zh_cn: 要排除的文件模式

# @info:tooltip
source: If this is checked you can enter a shell pattern in the text box on the right or select entries from the list.
eo: Se ĉi tio estas markita, vi povas enigi ŝelan ŝablonon en la tekstujon dekstre aŭ elekti enskribojn el la listo.
zh_cn: 如果选上，可以在右边文本框输入 shell 模式或从列表中选择。

# @info:tooltip
source: Here you can enter or remove a shell pattern or select one or more entries from the list.
eo: Ĉi tie vi povas enigi aŭ forigi ŝelan ŝablonon aŭ elekti unu aŭ plurajn enskribojn el la listo.
zh_cn: 这里可以输入或删除 shell 模式或从列表中选择一个或多个模式。

# @title:group
source: File with Filenames to Exclude
eo: Dosiero kun Dosiernomoj por Ekskludi
is: Skrár með skráaheitum sem á að undanskilja
zh_cn: 要排除的文件名称

# @info:tooltip
source: If this is checked you can enter a filename in the combo box below.
eo: Se ĉi tio estas markita, vi povas enigi dosiernomon en la kombinujon sube.
is: Ef merkt er við þetta geturðu sett skráarheiti í reitinn hér fyrir neðan.
zh_cn: 如果选上，可以在下面的组合框输入文件名。

# @info:tooltip
source: Here you can enter the URL of a file with shell patterns to ignore during the comparison of the folders.
eo: Ĉi tie vi povas enigi la URL de dosiero kun ŝelaj ŝablonoj por ignori dum la komparo de la dosierujoj.
zh_cn: 这里可以输入在文件夹比较时要忽略的文件的 URL，该 URL 含有 shell 模式。

# @info:tooltip
source: Any file you select in the dialog that pops up when you click it will be put in the dialog to the left of this button.
eo: Ajna dosiero, kiun vi elektas en la dialogo, kiu aperas kiam vi alklakas ĝin, estos metita en la dialogon maldekstre de ĉi tiu butono.
zh_cn: 任何在弹出的对话框中点击选择的文件将会放入此按钮左边的对话框中。

# @title:tab
source: Exclude
eo: Eskludi
is: Útiloka
zh_cn: 排除

# @info:tooltip
source: Select file
eo: Elekti dosieron
is: Veldu skrá
zh_cn: 选择文件

# @info:tooltip
source: Select folder
eo: Elekti dosierujon
is: Veldu möppu
zh_cn: 选择文件夹

# @title:group
source: Encoding
eo: Kodoprezento
is: Stafatafla
zh_cn: 编码

# @item:inlistbox encoding
source: Default
eo: Defaŭlte
is: Sjálfgefið
zh_cn: 默认

# @title:window
source: Select Folder
eo: Elekti Dosierujon
is: Veldu möppu
zh_cn: 选择文件夹

# @title:window
source: Select File
eo: Elekti Dosieron
is: Veldu skrá
zh_cn: 选择文件

# @title:group
source: Colors
eo: Koloroj
is: Litir
zh_cn: 颜色

# @label:chooser
source: Removed color:
eo: Forigita koloro:
is: Fjarlægt litur:
zh_cn: 删除文本的颜色：

# @label:chooser
source: Changed color:
eo: Ŝanĝita koloro:
is: Breytt lítur
zh_cn: 改变文本的颜色：

# @label:chooser
source: Added color:
eo: Aldonita koloro:
is: Bætt við litur:
zh_cn: 新增文本的颜色：

# @label:chooser
source: Applied color:
eo: Aplikita koloro:
is: Virkjað litur:
zh_cn: 应用文本的颜色：

# @title:group
source: Mouse Wheel
eo: Musa Rado
is: Músarhjól
zh_cn: 鼠标滚轮

# @label:spinbox
source: Number of lines:
eo: Nombro de linioj:
is: Fjöldi lína:
zh_cn: 行数：

# @title:group
source: Tabs to Spaces
eo: Tabs al Spacoj
is: Tab í bil
zh_cn: 将制表符扩展成空格

# @label:spinbox
source: Number of spaces to convert a tab character to:
eo: Nombro da spacoj por konverti tabuladon al:
is: Fjöldi bila til að breyta tab-stafi í:
zh_cn: 制表符转换成空格的个数：

# @title:group
source: Text Font
eo: Teksta Tiparo
is: Textaletur
zh_cn: 文本字体

# @label:listbox
source: Font:
eo: Tiparo:
is: Letur:
zh_cn: 字体：

# @label:spinbox
source: Size:
eo: Grandeco:
is: Stærð:
zh_cn: 大小：

# @title:tab
source: Fonts
eo: Tiparoj
is: Letur
zh_cn: 字体

# @title:column
source: Source Folder
eo: Fonta Dosierujo
is: Upprunamappa
zh_cn: 源文件夹

# @title:column
source: Destination Folder
eo: Destina Dosierujo
is: Úttaksmappa
zh_cn: 目标文件夹

# @title:column
source: Source File
eo: Fontdosiero
is: Upprunaskrá
zh_cn: 源文件

# @title:column
source: Destination File
eo: Celodosiero
is: Úttaksskrá
zh_cn: 目标文件

# @title:column
source: Source Line
eo: Fontlinio
is: Upprunalína
zh_cn: 源文件行

# @title:column
source: Destination Line
eo: Cellinio
is: Úttakslína
zh_cn: 目标文件行

# @title:column
source: Difference
eo: Diferenco
is: Mismunur
zh_cn: 差异

source: Applied: Changes made to %1 line undone
is: Virkjað: Breytingar gerðar á %1 línu afturkallaðar
zh_cn: 应用结果：未完成 %1 行的修改

source: Changed %1 line
is: Breytti %1 línu
zh_cn: 更改了 %1 行

source: Applied: Insertion of %1 line undone
is: Virkjað: Innsetning á %1 línu afturkölluð
zh_cn: 应用结果：未完成 %1 行的插入

source: Inserted %1 line
is: Bætti við %1 línu
zh_cn: 插入了 %1 行

source: Applied: Deletion of %1 line undone
is: Virkjað: Eyðing á %1 línu afturkölluð
zh_cn: 应用结果：未完成 %1 行的删除

source: Deleted %1 line
is: Eyddi %1 línu
zh_cn: 删除了 %1 行

# @item directory name not known
source: Unknown
eo: Nekonata
is: Óþekkt
zh_cn: 未知

# @action
source: Save &All
eo: Kons&ervi Ĉion
is: Vist&a Allt
zh_cn: 全部保存(&A)

# @action
source: Save &Diff...
eo: Konservi &Dif-on...
is: Vista &diff-mismun...
zh_cn: 保存差异文件(&D)...

# @action
source: Swap Source with Destination
eo: Interŝanĝi Fonton kun Celo
is: Víxla á uppruna og áfangastað
zh_cn: 交换源文件和目标文件

# @action
source: Show Statistics
eo: Montri Statistikojn
is: Sýna tölfræði
zh_cn: 显示统计信息

# @action
source: Refresh Diff
eo: Refreŝigi Diff
is: Endurlesa mismun
zh_cn: 刷新 Diff

source: <qt>The URL <b>%1</b> cannot be downloaded.</qt>
eo: <qt>La URL <b>%1</b> ne estas elŝutebla.</qt>
is: <qt>Tókst ekki að ná í slóðina <b>%1</b>.</qt>
zh_cn: <qt>URL <b>%1</b> 无法下载。</qt>

source: <qt>The URL <b>%1</b> does not exist on your system.</qt>
eo: <qt>La URL <b>%1</b> ne ekzistas en via sistemo.</qt>
is: <qt>Slóðin <b>%1</b> er ekki til á kerfinu þínu.</qt>
zh_cn: <qt>URL <b>%1</b> 在您的系统上不存在。</qt>

# @title:window
source: Diff Options
eo: Diferaj Opcioj
is: Valkostir diff-mismunar
zh_cn: Diff 选项

# @title:window
source: Save .diff
eo: Konservi .diff
is: Vista .diff
zh_cn: 保存 .diff 文件

source: Patch Files (*.diff *.dif *.patch)
eo: Flikdosieroj (*.diff *.dif *.patch)
is: Patch-skrár (*.diff *.dif *.patch)
zh_cn: 补丁文件 (*.diff *.dif *.patch)
