Repository: KDE/kompare
Catalog: po/*/kompare.po
Languages: eo, is, zh_cn

# @info:status
source: Running diff...
eo: Rulante diff...
is: Keyri diff...
zh_cn: 运行 diff...

# @info:status
source: Parsing diff output...
eo: Analizante diff-eligon...
is: Þátta diff-mismunaútták...
zh_cn: 分析 diff 输出...

# @info:status
source: Comparing file %1 with file %2
eo: Komparante dosieron %1 kun dosiero %2
is: Ber skrána %1 saman við skrána %2
zh_cn: 正在比较文件 %1 和 %2

# @info:status
source: Comparing files in %1 with files in %2
eo: Komparante dosierojn en %1 kun dosieroj en %2
is: Ber saman skrár í %1 við skrár í %2
zh_cn: 正在比较 %1 和 %2 中的文件

# @info:status
source: Viewing diff output from %1
eo: Rigardante dif-eligon de %1
is: Sýni diff úttak frá %1
zh_cn: 查看 %1 的 diff 结果

# @info:status
source: Blending diff output from %1 into file %2
eo: Miksado de diferenco eligo de %1 en dosieron %2
is: Blanda diff-mismunaúttaki frá %1 í skrá %2
zh_cn: 合并 %1 的 diff 结果到文件 %2

# @info:status
source: Blending diff output from %1 into folder %2
eo: Miksado de diferenco eligo de %1 en dosierujon %2
is: Blanda diff-mismunaúttaki frá %1 í möppu %2
zh_cn: 合并 %1 的 diff 结果到文件夹 %2

source: You have made changes to the destination file(s). Would you like to save them?
eo: Vi faris ŝanĝojn al la celdosiero(j). Ĉu vi ŝatus konservi ilin?
is: Þú hefur gert breytingar á áfangastað. Viltu vista þær?
zh_cn: 目标文件已经修改, 要保存吗？

# @title:window
source: Save Changes?
eo: Ĉu konservi Ŝanĝojn?
is: Vista breytingar?
zh_cn: 保存修改？

# @item diff format
source: Unified
eo: Unuigita
is: Sameinað
zh_cn: 统一

# @item diff format
source: Context
eo: Kunteksto
is: Samhengi
zh_cn: 上下文

# @item diff format
source: Normal
eo: Normala
is: Venjulegt
zh_cn: 正常

# @item diff format
source: Unknown
eo: Nekonata
is: Óþekkt
zh_cn: 未知

source: No diff file, or no 2 files have been diffed. Therefore no stats are available.
eo: Neniu diferenco-dosiero, aŭ neniu 2 dosiero estis malsamata. Tial neniuj statistikoj estas haveblaj.
is: Engin diff-skrá, eða engar tvær skrár hafa verið athugaðar. Þess vegna eru engar tölfræðiupplýsingar tiltækar.
zh_cn: 没有 diff 文件，或没有比较两个文件，因为统计信息不可用。

# @title:window
source: Diff Statistics
eo: Diferenca Statistiko
is: Tölfræði diff-mismunar
zh_cn: Diff 统计

source: Statistics: Old file: %1 New file: %2 Format: %3 Number of hunks: %4 Number of differences: %5
eo: Statistiko: Malnova dosiero: %1 Nova dosiero: %2 Formato: %3 Nombro da partoj: %4 Nombro da diferencoj: %5
is: Tölfræði: Gamla skráin: %1 Nýja skráin: %2 Snið: %3 Fjöldi blokka: %4 Fjöldi mismuna: %5
zh_cn: 统计： 旧文件：%1 新文件：%2 格式：%3 相同个数：%4 差异个数：%5

source: Statistics: Number of files in diff file: %1 Format: %2 Current old file: %3 Current new file: %4 Number of hunks: %5 Number of differences: %6
eo: Statistiko: Nombro de dosieroj en difdosiero: %1 Formato: %2 Nuna malnova dosiero: %3 Nuna nova dosiero: %4 Nombro de partoj: %5 Nombro de diferencoj: %6
is: Tölfræði: Fjöldi skráa í diff-mismunaskrá: %1 Snið: %2 Núverandi gamla skrá: %3 Núverandi nýja skrá: %4 Fjöldi blokka: %5 Fjöldi mismuna: %6
zh_cn: 统计： diff结果中的文件个数：%1 格式：%2 当前旧文件：%3 当前新文件：%4 相同个数：%5 差异个数：%6

source: &Difference
eo: &Diferenco
is: &Mismunur
zh_cn: 差异(&D)

# @title:window
source: Preferences
eo: Preferaĵoj
is: Stillingar
zh_cn: 首选项

# @title:tab
source: View
eo: Vido
is: Skoðun
zh_cn: 视图

# @title
source: View Settings
eo: Vida agordo
is: Stillingar sýnar
zh_cn: 视图设置

# @title
source: Diff Settings
eo: Dif-Agordoj
is: Stillingar diff-mismunar
zh_cn: Diff 设置

source: Format
eo: Formato
is: Snið
zh_cn: 格式

source: &Context
eo: &Kunteksto
is: Sam&hengi
zh_cn: 上下文(&C)

source: &Normal
eo: &Normala
is: Ve&njulegt
zh_cn: 正常(&N)

source: &Unified
eo: &Unuigita
is: Sa&meinað
zh_cn: 统一(&U)

source: &Side-by-side
eo: &Flank-al-flanko
is: H&lið-við-hlið
zh_cn: 并排(&S)

source: Number of context lines:
eo: Nombro da kuntekstlinioj:
is: Fjöldi samhengislína:
zh_cn: 上下文行数：

source: Options
eo: Opcioj
is: Valkostir
zh_cn: 选项

source: Look for smaller changes
eo: Serĉi pli malgrandajn ŝanĝojn
is: Leita að smærri breytingum
zh_cn: 查找较小的改动

source: Optimize for large files
eo: Optimumigi por grandaj dosieroj
is: Besta fyrir stórar skrár
zh_cn: 优化大文件

source: Ignore changes in case
eo: Ignori ŝanĝojn de uskleco
is: Hunsa breytingar á há-/lágstöfum
zh_cn: 忽略大小写的变化

source: Expand tabs to spaces
eo: Vastigi langetojn al spacoj
is: Breyta dálkalykli (Tab) í bil
zh_cn: 将制表符扩展成空格

source: Ignore added or removed empty lines
eo: Ignori aldonitajn aŭ forigitajn malplenajn liniojn
is: Hunsa viðbættar eða fjarlægðar tómar línur
zh_cn: 忽略新增或删除的空行

source: Ignore changes in whitespace
eo: Ignori ŝanĝojn en blankspaco
is: Hunsa breytingar í bilum
zh_cn: 忽略空白的变化

source: Show function names
eo: Montri funkcionomojn
is: Sýna nöfn falla
zh_cn: 显示函数名称

source: Compare folders recursively
eo: Kompari dosierujojn rekursie
is: Bera saman möppur arfgengt
zh_cn: 递归比较文件夹

source: Treat new files as empty
eo: Trakti novajn dosierojn kiel malplenajn
is: Fara með nýjar skrár sem tómar
zh_cn: 新文件作为空文件处理

source: Run Diff In
eo: Lanĉi Diff En
is: Keyra diff-mismun í
zh_cn: 运行 diff 在

source: Command Line
eo: Komandlinio
is: Skipanalína
zh_cn: 命令行

source: cd dir && diff -udHprNa -- source destination
eo: cd dir && diff -udHprNa -- fontcelloko
zh_cn: cd 目录 && diff -udHprNa -- 源 目标

source: Could not load our KompareViewPart: %1
eo: Ne eblis ŝargi nian KompareViewPart: %1
is: Gat ekki hlaðið inn okkar KompareViewPart: %1

source: Could not load our KompareNavigationPart: %1
eo: Ne eblis ŝargi nian KompareNavigationPart: %1
is: Gat ekki hlaðið inn okkar KompareNavigationPart: %1

# @title:tab
source: Diff
eo: Diferenco
is: Mismunur/diff

# @info:whatsthis
source: If you have entered a file or folder name and a file that contains diff output in the fields in this dialog then this button will be enabled and pressing it will open kompare's main view where the output of the entered file or files from the folder are mixed with the diff output so you can then apply the difference(s) to a file or to the files.
is: Ef þú hefur sett inn í svæðin á þessum glugga skráar- eða möppunafn og skrá sem inniheldur diff-mismunaúttak, mun þessi hnappur vera virkjaður og með því að smella á hann opnast aðalgluggi kompare þar sem úttaki valinnar skráar eða skráa úr möppu er blandað saman við diff úttakið svo þú getir síðan sett mismuninn yfir í skrá eða í skrárnar.

# @item diff format
source: Ed
is: Br
